import sys
sys.stdin = open("input.txt", "r")

dct1 = {'0':'0000', '1':'0001', '2':'0010', '3':'0011', '4':'0100', '5':'0101', '6':'0110', '7':'0111', '8':'1000', '9':'1001', 'A':'1010','B':'1011','C':'1100','D':'1101','E':'1110','F':'1111'}
dct2 = {'001101':0, '010011':1, '111011':2, '110001':3, '100011':4, '110111':5, '001011':6, '111101':7, '011001':8, '101111':9 }
T = int(input())
for test_case in range(1, T+1):
    in_st = input()
    # [1] 16진수를 2진수(str)로 저장
    st = ''
    for ch in in_st:
        st += dct1[ch]

    # [2] 오른쪽 끝의 '1' 찾기
    e = len(st)-1
    while st[e] == '0':
        e -= 1

    # [3] 최초시작위치부터 6개씩 암호변환
    ans = []
    for i in range((e-5)%6, e, 6):
        ans.append(dct2[st[i:i+6]])

    print(f'#{test_case}', *ans)


